Repository: mubtAAhij/CodeEdit
Catalog: CodeEdit/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fr_fr, zh_cn

# open-quickly.title
source: Open Quickly
es_419: Abrir rápidamente
fr_fr: Ouverture rapide
zh_cn: 快速打开

# common.cancel
source: Cancel
es_419: Cancelar
fr_fr: Annuler
zh_cn: 取消

# settings.navigation.style
source: Navigation Style
es_419: Estilo de navegación
fr_fr: Style de navigation
zh_cn: 导航样式

# source-control.ignored-files.empty
source: No ignored files
es_419: No hay archivos ignorados
fr_fr: Aucun fichier ignoré
zh_cn: 无忽略文件

# settings.title
source: Settings
es_419: Configuración
fr_fr: Réglages
zh_cn: 设置

# terminal.start-error
source: Failed to start a terminal session: %@
es_419: No se pudo iniciar una sesión de terminal: %@
fr_fr: Échec du démarrage d'une session terminal : %@
zh_cn: 启动终端会话失败：%@

# terminal.accessibility.label
source: Terminal Emulator
es_419: Emulador de Terminal
fr_fr: Émulateur de terminal
zh_cn: 终端模拟器

# utility-area.filter
source: Filter
es_419: Filtrar
fr_fr: Filtrer
zh_cn: 过滤

# utility-area.accessibility.label
source: Utility Area
es_419: Área de utilidades
fr_fr: Zone utilitaire
zh_cn: 实用工具区域

# welcome.clone-repo
source: Clone Git Repository...
es_419: Clonar un repositorio de Git...
fr_fr: Cloner un dépôt Git...
zh_cn: 克隆 Git 仓库...

# welcome.new-file
source: Create New File...
es_419: Crear archivo nuevo...
fr_fr: Créer un nouveau fichier...
zh_cn: 创建新文件...

# welcome.open-file-or-folder
source: Open File or Folder...
es_419: Abrir archivo o carpeta...
fr_fr: Ouvrir un fichier ou un dossier...
zh_cn: 打开文件或文件夹...

# welcome.copy-system-info
source: Copy System Information to Clipboard
es_419: Copiar información del sistema al portapapeles
fr_fr: Copier les informations système dans le presse-papiers
zh_cn: 复制系统信息到剪贴板

# file-menu.open-recent
source: Open Recent
es_419: Abrir recientes
fr_fr: Ouvrir un élément récent
zh_cn: 打开最近文件

# workspace-panel.no-selection
source: No Selection
es_419: Sin selección
fr_fr: Aucune sélection
zh_cn: 未选择

# quick-actions.title
source: Commands
es_419: Comandos
fr_fr: Commandes
zh_cn: 命令

# editor.jump-bar.no-selection
source: No Selection
es_419: Sin selección
fr_fr: Aucune sélection
zh_cn: 无所选项

# common.close
source: Close
es_419: Cerrar
fr_fr: Fermer
zh_cn: 关闭

# editor.tab-bar.accessibility.label
source: Tab Bar
es_419: Barra de pestañas
fr_fr: Barre d'onglets
zh_cn: 标签栏

# editor.no-editor
source: No Editor
es_419: Sin editor
fr_fr: Aucun éditeur
zh_cn: 无编辑器

# editor.image.error
source: Cannot preview image
es_419: No se puede previsualizar la imagen
fr_fr: Impossible de prévisualiser l'image
zh_cn: 无法预览图像

# editor.loading
source: Opening %@...
es_419: Abriendo %@...
fr_fr: Ouverture de %@...
zh_cn: 正在打开 %@...

# editor.error.no-url
source: Cannot retrieve URL to the file you opened.
es_419: No se puede recuperar la URL del archivo que abriste.
fr_fr: Impossible de récupérer l'URL du fichier ouvert.
zh_cn: 无法获取您打开的文件的 URL。

# feedback.window.title
source: Feedback for CodeEdit
es_419: Comentarios para CodeEdit
fr_fr: Commentaires sur CodeEdit
zh_cn: CodeEdit 反馈

# inspector.history.empty
source: No History
es_419: Sin historial
fr_fr: Aucun historique
zh_cn: 无历史记录

# inspector-area.accessibility.label
source: inspector
fr_fr: Inspecteur
zh_cn: 检查器

# inspector.no-selection
source: No Selection
es_419: Sin selección
fr_fr: Aucune sélection
zh_cn: 无所选项

# common.dismiss
source: Dismiss
es_419: Descartar
fr_fr: Fermer
zh_cn: 关闭

# source-control.changes.empty
source: No Changes
es_419: Sin cambios
fr_fr: Aucune modification
zh_cn: 无更改

# source-control.commit.co-author
source: Co-authored by: %@ <%@>
es_419: Coautoría de: %@ <%@>
fr_fr: Co-écrit par : %@ <%@>
zh_cn: 共同作者：%@ <%@>

# navigator-area.accessibility.label
source: navigator
es_419: navegador
fr_fr: navigateur
zh_cn: 导航器

# about.license
source: MIT License
fr_fr: Licence MIT
zh_cn: MIT 许可证

# about.package-file
source: Package
es_419: Paquete
fr_fr: Paquet
zh_cn: 包

# about.acknowledgements
source: Acknowledgements
es_419: Reconocimientos
fr_fr: Remerciements
zh_cn: 鸣谢

# about.contributors
source: Contributors
es_419: Colaboradores
fr_fr: Contributeurs
zh_cn: 贡献者

# activity-viewer.accessibility.label
source: Activity Viewer
es_419: Visor de Actividad
fr_fr: Visualiseur d'activité
zh_cn: 活动查看器

# activity-viewer.working
source: working
es_419: trabajando
fr_fr: en cours
zh_cn: 工作中

# task.target.my-mac
source: My Mac
es_419: Mi Mac
fr_fr: Mon Mac
zh_cn: 我的 Mac

# shell-integration.bash-file-not-found
source: Failed to find bash injection file.
es_419: No se pudo encontrar el archivo de inyección de bash.
fr_fr: Échec de la recherche du fichier d'injection bash.
zh_cn: 找不到 bash 注入文件

# shell-integration.zsh-file-not-found
source: Failed to find zsh injection file.
es_419: No se pudo encontrar el archivo de inyección de zsh.
fr_fr: Échec de la recherche du fichier d'injection zsh.
zh_cn: 找不到 zsh 注入文件

# terminal.exit-code
source: Exit code: %d
es_419: Código de salida: %d
fr_fr: Code de sortie : %d
zh_cn: 退出码: %d

# terminal.new-session-instruction
source: To open a new session, create a new terminal tab.
es_419: Para abrir una sesión nueva, crea una pestaña de terminal nueva.
fr_fr: Pour ouvrir une nouvelle session, créez un nouvel onglet de terminal.
zh_cn: 要打开新会话，请创建新终端标签页。

# utility-area.terminal-tab
source: Terminal Tab
es_419: Pestaña de terminal
fr_fr: Onglet Terminal
zh_cn: 终端标签页

# utility-area.no-terminals
source: No Open Terminals
es_419: No hay terminales abiertas
fr_fr: Aucun terminal ouvert
zh_cn: 无打开的终端

# extensions.open-window
source: Open Extensions Window
es_419: Abrir ventana de extensiones
fr_fr: Ouvrir la fenêtre des extensions
zh_cn: 打开扩展窗口

# app.unknown-name
source: Unknown App
es_419: Aplicación desconocida
fr_fr: App inconnue
zh_cn: 未知应用

# workspace.git-refresh-error
source: Error refreshing Git data
es_419: Error al actualizar datos de Git
fr_fr: Erreur lors de l'actualisation des données Git
zh_cn: 刷新 Git 数据时出错

# workspace.accessibility.label
source: workspace area
es_419: área del área de trabajo
fr_fr: zone de l'espace de travail
zh_cn: 工作区区域

# search-settings.ignore-glob-patterns
source: Ignore Glob Patterns
es_419: Patrones Glob a Ignorar
fr_fr: Motifs glob à ignorer
zh_cn: 忽略 Glob 模式

# search-settings.ignore-patterns
source: Ignore Patterns
es_419: Patrones de ignorar
fr_fr: Motifs à ignorer
zh_cn: 忽略模式

# theme.import
source: Import Theme...
es_419: Importar tema...
fr_fr: Importer un thème...
zh_cn: 导入主题...

# theme.error.url-not-found
source: Theme file URL not found
es_419: No se encontró la URL del archivo de tema
fr_fr: URL du fichier de thème introuvable
zh_cn: 未找到主题文件 URL

# theme.font-style.bold
source: Bold
es_419: Negrita
fr_fr: Gras
zh_cn: 粗体

# theme.font-style.italic
source: Italic
es_419: Cursiva
fr_fr: Italique
zh_cn: 斜体

# settings.font.system
source: System Font
es_419: Fuente del sistema
fr_fr: Police système
zh_cn: 系统字体

# settings.font.other-fonts
source: Other fonts...
es_419: Otras fuentes...
fr_fr: Autres polices…
zh_cn: 其他字体...

# settings.warning-characters.description
source: CodeEdit can help identify invisible or ambiguous characters, such as zero-width spaces, directional quotes, and more. These will appear with a red block highlighting them. You can disable characters or add more here.
es_419: CodeEdit puede ayudar a identificar caracteres invisibles o ambiguos, como espacios de ancho cero, comillas direccionales y más. Estos aparecerán con un bloque rojo que los resalta. Puedes desactivar caracteres o agregar más aquí.
fr_fr: CodeEdit peut aider à identifier les caractères invisibles ou ambigus, tels que les espaces sans largeur, les guillemets directionnels, et plus encore. Ceux-ci apparaîtront avec un bloc rouge les mettant en surbrillance. Vous pouvez désactiver des caractères ou en ajouter d'autres ici.
zh_cn: CodeEdit 可以帮助识别不可见或有歧义的字符,例如零宽空格、方向引号等。这些字符将以红色块状高亮显示。您可以在此处停用字符或添加更多字符。

# common.done
source: Done
es_419: Listo
fr_fr: Terminé
zh_cn: 完成

# source-control.discard-error
source: Failed to discard changes
es_419: No se pudieron descartar los cambios
fr_fr: Échec de l'abandon des modifications
zh_cn: 丢弃更改失败

# tasks.start
source: Start Task
es_419: Iniciar tarea
fr_fr: Démarrer la tâche
zh_cn: 启动任务

# tasks.start.tooltip
source: Run the selected task
es_419: Ejecutar la tarea seleccionada
fr_fr: Exécuter la tâche sélectionnée
zh_cn: 运行所选任务

# tasks.stop
source: Stop %@
es_419: Detener %@
fr_fr: Arrêter %@
zh_cn: 停止 %@

# tasks.stop.tooltip
source: Stop the selected task
es_419: Detener la tarea seleccionada
fr_fr: Arrêter la tâche sélectionnée
zh_cn: 停止所选任务

# tasks.start-button
source: Start
es_419: Iniciar
fr_fr: Démarrer
zh_cn: 启动

# tasks.start-button.tooltip
source: Start selected task
es_419: Iniciar tarea seleccionada
fr_fr: Démarrer la tâche sélectionnée
zh_cn: 启动所选任务

# tasks.stop-button
source: Stop
es_419: Detener
fr_fr: Arrêter
zh_cn: 停止

# tasks.stop-button.tooltip
source: Stop selected task
es_419: Detener la tarea seleccionada
fr_fr: Arrêter la tâche sélectionnée
zh_cn: 停止所选任务

# lsp.installer.unknown
source: Unknown
es_419: Desconocido
fr_fr: Inconnu
zh_cn: 未知

# lsp.installer.unsupported
source: (Unsupported) %@
es_419: (No compatible) %@
fr_fr: (Non pris en charge) %@
zh_cn: (不支持) %@

# lsp.package-manager.build-from-source
source: Build From Source
es_419: Compilar desde la fuente
fr_fr: Compiler depuis les sources
zh_cn: 从源码构建

# lsp.package-manager.download-from-github
source: Download From GitHub
es_419: Descargar desde GitHub
fr_fr: Télécharger depuis GitHub
zh_cn: 从 GitHub 下载

# lsp.install.removing-existing
source: Removing existing installation.
es_419: Eliminando instalación existente.
fr_fr: Suppression de l'installation existante.
zh_cn: 正在移除现有安装。

# lsp.install.creating-directory
source: Creating directory: %@
es_419: Creando directorio: %@
fr_fr: Création du répertoire : %@
zh_cn: 正在创建目录：%@

# find-navigator.indexing-progress
source: Indexing %d%%
es_419: Indexando %d%%
fr_fr: Indexation %d%%
zh_cn: 索引中 %d%%

# find-navigator.indexing-help
source: Indexing current workspace files for search. Searches performed while indexing may return incomplete results.
es_419: Indexando archivos del área de trabajo actual para la búsqueda. Las búsquedas realizadas durante la indexación pueden devolver resultados incompletos.
fr_fr: Indexation des fichiers de l'espace de travail actuel pour la recherche. Les recherches effectuées pendant l'indexation peuvent retourner des résultats incomplets.
zh_cn: 正在为搜索索引当前工作区文件。索引过程中执行的搜索可能返回不完整的结果。

# common.filter
source: Filter
es_419: Filtrar
fr_fr: Filtrer
zh_cn: 过滤

# find-navigator.filter.help
source: Show results with matching text
es_419: Mostrar resultados con texto coincidente
fr_fr: Afficher les résultats avec le texte correspondant
zh_cn: 显示匹配文本的结果

# project-navigator.accessibility.label
source: Project Navigator
es_419: Navegador de proyectos
fr_fr: Navigateur de projet
zh_cn: 项目导航器

# project-navigator.no-results
source: No Filter Results
es_419: Sin resultados de filtro
fr_fr: Aucun résultat
zh_cn: 无过滤结果

# source-control.no-remotes
source: No remotes
es_419: Sin remotos
fr_fr: Aucun dépôt distant
zh_cn: 无远程

# common.add
source: Add
es_419: Agregar
fr_fr: Ajouter
zh_cn: 添加

# source-control.commit-details
source: Commit Details
es_419: Detalles del Commit
fr_fr: Détails du commit
zh_cn: 提交详情

# source-control.commit.no-changes
source: No Changes
es_419: Sin cambios
fr_fr: Aucune modification
zh_cn: 无更改

# settings.language-servers.warning
source: Warning: Language server installation is experimental. Use at your own risk.
es_419: Advertencia: La instalación de servidores de lenguaje es experimental. Usa esta función bajo tu propio riesgo.
fr_fr: Avertissement : L'installation de serveur de langage est expérimentale. Utilisez-la à vos risques et périls.
zh_cn: 警告:语言服务器安装功能为实验性功能。使用风险自负。

# settings.language-servers.info
source: CodeEdit makes use of the Mason Registry for language server installation. To install a package, CodeEdit uses the package manager directed by the Mason Registry, and installs a copy of the language server in Application Support. Language server installation is still experimental, there may be bugs and expect this flow to change over time.
es_419: CodeEdit utiliza el Mason Registry para la instalación de servidores de lenguaje. Para instalar un paquete, CodeEdit usa el gestor de paquetes indicado por el Mason Registry e instala una copia del servidor de lenguaje en Application Support. La instalación de servidores de lenguaje aún es experimental, puede haber errores y este flujo cambiará con el tiempo.
fr_fr: CodeEdit utilise le registre Mason pour l'installation des serveurs de langage. Pour installer un paquet, CodeEdit utilise le gestionnaire de paquets indiqué par le registre Mason et installe une copie du serveur de langage dans Application Support. L'installation des serveurs de langage est encore expérimentale, des bogues peuvent survenir et ce processus est susceptible d'évoluer.
zh_cn: CodeEdit 使用 Mason Registry 来安装语言服务器。安装包时，CodeEdit 使用 Mason Registry 指定的包管理器，并在 Application Support 中安装语言服务器的副本。 语言服务器安装功能仍处于实验阶段，可能存在错误，且此流程可能会随时间变化。

# common.delete
source: Delete
es_419: Eliminar
fr_fr: Supprimer
zh_cn: 删除

# error.unknown
source: unknown error
es_419: error desconocido
fr_fr: erreur inconnue
zh_cn: 未知错误

# file.open-workspace-or-file
source: Open Workspace or File
es_419: Abrir área de trabajo o archivo
fr_fr: Ouvrir un espace de travail ou un fichier
zh_cn: 打开工作区或文件

# editor.history.back
source: Navigate back
es_419: Navegar hacia atrás
fr_fr: Naviguer en arrière
zh_cn: 后退

# editor.history.forward
source: Navigate forward
es_419: Navegar hacia adelante
fr_fr: Naviguer vers l'avant
zh_cn: 前进

# terminal.reset
source: Reset the terminal
es_419: Restablecer el terminal
fr_fr: Réinitialiser le terminal
zh_cn: 重置终端

# terminal.split.not-implemented
source: Implementation Needed
es_419: Implementación necesaria
fr_fr: Implémentation requise
zh_cn: 需要实现

# help.whats-new
source: What's New in CodeEdit
es_419: Novedades de CodeEdit
fr_fr: Nouveautés de CodeEdit
zh_cn: CodeEdit 新增功能

# help.release-notes
source: Release Notes
es_419: Notas de la versión
fr_fr: Notes de version
zh_cn: 发行说明

# help.report-issue
source: Report an Issue
es_419: Reportar un problema
fr_fr: Signaler un problème
zh_cn: 报告问题

# app.about
source: About CodeEdit
es_419: Acerca de CodeEdit
fr_fr: À propos de CodeEdit
zh_cn: 关于 CodeEdit

# app.check-updates
source: Check for updates...
es_419: Buscar actualizaciones...
fr_fr: Rechercher des mises à jour...
zh_cn: 检查更新...

# app.settings
source: Settings...
es_419: Configuración...
fr_fr: Réglages…
zh_cn: 设置...

# window.welcome
source: Welcome to CodeEdit
es_419: Bienvenido a CodeEdit
fr_fr: Bienvenue dans CodeEdit
zh_cn: 欢迎使用 CodeEdit

# window.about
source: About CodeEdit
es_419: Acerca de CodeEdit
fr_fr: À propos de CodeEdit
zh_cn: 关于 CodeEdit

# window.extensions
source: Manage Extensions
es_419: Administrar extensiones
fr_fr: Gérer les extensions
zh_cn: 管理扩展

# navigation-settings.style
source: Navigation Style
es_419: Estilo de navegación
fr_fr: Style de navigation
zh_cn: 导航样式

# navigation-settings.open-in-tabs
source: Open in Tabs
es_419: Abrir en pestañas
fr_fr: Ouvrir en onglets
zh_cn: 在标签页中打开

# navigation-settings.open-in-place
source: Open in Place
es_419: Abrir en el lugar
fr_fr: Ouvrir sur place
zh_cn: 就地打开

# search-settings.exclude
source: Exclude
es_419: Excluir
fr_fr: Exclure
zh_cn: 排除

# search-settings.exclude.description
source: Add glob patterns to exclude matching files and folders from searches and open quickly. This will inherit glob patterns from the Exclude from Project setting.
es_419: Agrega patrones glob para excluir archivos y carpetas coincidentes de las búsquedas y de abrir rápidamente. Esto heredará los patrones glob de la configuración Excluir del proyecto.
fr_fr: Ajoutez des motifs glob pour exclure les fichiers et dossiers correspondants des recherches et de l'ouverture rapide. Cela héritera des motifs glob du réglage Exclure du projet.
zh_cn: 添加 glob 模式以从搜索和快速打开中排除匹配的文件和文件夹。这将继承\"从项目中排除\"设置中的 glob 模式。

# search-settings.no-excluded-patterns
source: No excluded glob patterns
es_419: No hay patrones glob excluidos
fr_fr: Aucun motif glob exclu
zh_cn: 无排除的 glob 模式

# settings.not-implemented
source: Implementation Needed
es_419: Implementación necesaria
fr_fr: Implémentation requise
zh_cn: 需要实现

# common.edit
source: Edit
es_419: Editar
fr_fr: Modifier
zh_cn: 编辑

# common.remove
source: Remove
es_419: Eliminar
fr_fr: Supprimer
zh_cn: 移除

# utility-area.debug.no-task-selected
source: No Task Selected
es_419: No hay tarea seleccionada
fr_fr: Aucune tâche sélectionnée
zh_cn: 未选择任务

# utility-area.debug.no-tasks-running
source: No Tasks are Running
es_419: No se están ejecutando tareas
fr_fr: Aucune tâche en cours d'exécution
zh_cn: 没有正在运行的任务

# utility-area.tab.debug-console
source: Debug Console
es_419: Consola de depuración
fr_fr: Console de débogage
zh_cn: 调试控制台

# utility-area.tab.output
source: Output
es_419: Salida
fr_fr: Sortie
zh_cn: 输出

# inspector.history.show-commit
source: Show Commit
es_419: Mostrar commit
fr_fr: Afficher le commit
zh_cn: 显示提交

# inspector.history.code-review
source: Open in Code Review
es_419: Abrir en revisión de código
fr_fr: Ouvrir dans Code Review
zh_cn: 在 Code Review 中打开

# inspector-area.tab.file
source: File Inspector
es_419: Inspector de archivos
fr_fr: Inspecteur de fichier
zh_cn: 文件检查器

# inspector-area.tab.history
source: History Inspector
es_419: Inspector de historial
fr_fr: Inspecteur d'historique
zh_cn: 历史记录检查器

# inspector-area.tab.internal-dev
source: Internal Development
es_419: Desarrollo Interno
fr_fr: Développement interne
zh_cn: 内部开发

# lsp.cargo.initialize
source: Initialize Directory Structure
es_419: Inicializar estructura de directorios
fr_fr: Initialiser la structure de répertoires
zh_cn: 初始化目录结构

# lsp.cargo.install
source: Install Package Using cargo
es_419: Instalar paquete usando cargo
fr_fr: Installer le paquet avec cargo
zh_cn: 使用 cargo 安装包

# lsp.cargo.install-confirmation
source: This requires the cargo package %@. Allow CodeEdit to install this package?
es_419: Esto requiere el paquete de cargo %@. ¿Permitir que CodeEdit instale este paquete?
fr_fr: Cela nécessite le paquet cargo %@. Autoriser CodeEdit à installer ce paquet ?
zh_cn: 这需要 cargo 包 %@。 允许 CodeEdit 安装此包？

# navigator-area.tab.project
source: Project
es_419: Proyecto
fr_fr: Projet
zh_cn: 项目

# navigator-area.tab.source-control
source: Source Control
es_419: Control de versiones
fr_fr: Contrôle de version
zh_cn: 版本控制

# navigator-area.tab.search
source: Search
es_419: Buscar
fr_fr: Recherche
zh_cn: 搜索

# accounts-settings.search-key
source: Accounts
es_419: Cuentas
fr_fr: Comptes
zh_cn: 账户

# accounts-settings.delete-account
source: Delete Account...
es_419: Eliminar cuenta...
fr_fr: Supprimer le compte...
zh_cn: 删除账户...

# accounts-settings.add-account
source: Add Account...
es_419: Agregar cuenta...
fr_fr: Ajouter un compte...
zh_cn: 添加账户...

# locations-settings.settings-location
source: Settings Location
es_419: Ubicación de configuración
fr_fr: Emplacement des réglages
zh_cn: 设置位置

# locations-settings.themes-location
source: Themes Location
es_419: Ubicación de temas
fr_fr: Emplacement des thèmes
zh_cn: 主题位置

# locations-settings.extensions-location
source: Extensions Location
es_419: Ubicación de extensiones
fr_fr: Emplacement des extensions
zh_cn: 扩展位置

# search.index.not-found
source: No index found. Try rebuilding the index.
es_419: No se encontró el índice. Intenta reconstruirlo.
fr_fr: Index introuvable. Essayez de reconstruire l'index.
zh_cn: 未找到索引。请尝试重建索引。

# search.decode-error
source: Failed to decode file content.
es_419: No se pudo decodificar el contenido del archivo.
fr_fr: Échec du décodage du contenu du fichier.
zh_cn: 文件内容解码失败。

# search.regex-error
source: Invalid regular expression.
es_419: Expresión regular inválida.
fr_fr: Expression régulière invalide.
zh_cn: 正则表达式无效。

# search.index.indexing-title
source: Indexing | Processing files
es_419: Indexando | Procesando archivos
fr_fr: Indexation | Traitement des fichiers
zh_cn: 索引 | 处理文件中

# search.index.indexing-message
source: Creating an index to enable fast and accurate searches within your codebase.
es_419: Creando un índice para habilitar búsquedas rápidas y precisas dentro de tu código base.
fr_fr: Création d'un index pour permettre des recherches rapides et précises dans votre code.
zh_cn: 正在创建索引以在代码库中实现快速准确的搜索。

# search.index.finished
source: Finished indexing
es_419: Indexación finalizada
fr_fr: Indexation terminée
zh_cn: 索引完成

# editor.tab-bar.close-editor
source: Close this Editor
es_419: Cerrar este editor
fr_fr: Fermer cet éditeur
zh_cn: 关闭此编辑器

# editor.tab-bar.unfocus-editor
source: Unfocus this Editor
es_419: Desactivar este editor
fr_fr: Retirer le focus de cet éditeur
zh_cn: 取消聚焦此编辑器

# editor.tab-bar.focus-editor
source: Focus this Editor
es_419: Enfocar este editor
fr_fr: Activer cet éditeur
zh_cn: 聚焦此编辑器

# editor.wrap-lines
source: Wrap Lines
es_419: Ajustar líneas
fr_fr: Retour à la ligne
zh_cn: 自动换行

# editor.split-vertically
source: Split Vertically
es_419: Dividir verticalmente
fr_fr: Fractionner verticalement
zh_cn: 垂直拆分

# editor.split-horizontally
source: Split Horizontally
es_419: Dividir horizontalmente
fr_fr: Fractionner horizontalement
zh_cn: 水平拆分

# extensions.features
source: Features
es_419: Funcionalidades
fr_fr: Fonctionnalités
zh_cn: 功能

# extensions.settings
source: Extension Settings
es_419: Configuración de extensiones
fr_fr: Réglages des extensions
zh_cn: 扩展设置

# extensions.settings-scene-id
source: Settings
es_419: Configuración
fr_fr: Réglages
zh_cn: 设置

# extensions.select-extension
source: Select an extension
es_419: Selecciona una extensión
fr_fr: Sélectionner une extension
zh_cn: 选择一个扩展

# extensions.selected-count
source: %d selected
es_419: %d seleccionados
fr_fr: %d sélectionnés
zh_cn: 已选择 %d 项

# common.save
source: Save
es_419: Guardar
fr_fr: Enregistrer
zh_cn: 保存

# task.list.empty
source: No tasks
es_419: No hay tareas
fr_fr: Aucune tâche
zh_cn: 无任务

# output.source-picker.label
source: Output Source
es_419: Fuente de salida
fr_fr: Source de sortie
zh_cn: 输出源

# output.source-picker.no-selection
source: No Selected Output Source
es_419: No hay fuente de salida seleccionada
fr_fr: Aucune source de sortie sélectionnée
zh_cn: 未选择输出源

# output.source-picker.no-language-servers
source: No Language Servers
es_419: No hay Servidores de Lenguaje
fr_fr: Aucun serveur de langage
zh_cn: 无语言服务器

# output.source-picker.no-extensions
source: No Extensions
es_419: Sin extensiones
fr_fr: Aucune extension
zh_cn: 无扩展

# terminal.new-terminal
source: New Terminal
es_419: Terminal nueva
fr_fr: Nouveau terminal
zh_cn: 新建终端

# terminal.new-with-profile
source: New Terminal With Profile
es_419: Terminal nueva con perfil
fr_fr: Nouveau terminal avec profil
zh_cn: 使用配置文件新建终端

# terminal.profile.default
source: Default
es_419: Predeterminado
fr_fr: Par défaut
zh_cn: 默认

# terminal.accessibility-label
source: Terminals
es_419: Terminales
fr_fr: Terminaux
zh_cn: 终端

# editor.menu.title
source: Editor
fr_fr: Éditeur
zh_cn: 编辑器

# editor.menu.move-line-up
source: Move line up
es_419: Mover línea hacia arriba
fr_fr: Déplacer la ligne vers le haut
zh_cn: 上移行

# editor.menu.move-line-down
source: Move line down
es_419: Mover línea hacia abajo
fr_fr: Déplacer la ligne vers le bas
zh_cn: 下移行

# theme.auto-change
source: Automatically change theme based on system appearance
es_419: Cambiar tema automáticamente según la apariencia del sistema
fr_fr: Changer automatiquement le thème selon l'apparence système
zh_cn: 根据系统外观自动更改主题
